// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. (Проверка на трехзначность при вводе пользователем)
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.Write("Введите трехзначное число : ");
// string number = Console.ReadLine()!;

// if (number.Length == 3)
// {
//     Console.WriteLine($"Вторая цифра {number[1]}");
// }
// else{
//     Console.WriteLine("Введено не трехзначное число");
// }

// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. (Максимум 100000)
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.Write("Введите число (Максимум 99999) : ");
// string number = Console.ReadLine()!;

// if (number.Length <= 6)
// {
//     if (number.Length < 3)
//     {
//         Console.WriteLine("Третьей цифры нет");
//     }
//     else
//     {
//        Console.WriteLine($"Третья цифра числа {number} - {number[2]}"); 
//     }
// }

// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.(использовать И и ИЛИ)
// 6 -> да
// 7 -> да
// 1 -> нет


// Console.Write("Введите номер дня недели : ");
// int number_week = Convert.ToInt32(Console.ReadLine()!);
// int x = number_week;

// if (x == 6 || x == 7)
// {
//     Console.WriteLine("Сегодня выходной");
// }
// else
// {
//     Console.WriteLine("Сегодня не выходной");
// }

